[![imagenes/pythonista.png](imagenes/pythonista.png)](https://pythonista.io)

## El método ```pd.DataFrame.apply()```.

El método ```pd.DataFrame.apply()``` permite aplicar una función a una serie o dataframe de *Pandas*.

```
<objeto de Pandas>.apply(<funcion>, axis=<eje>)
```

Esta función es realiza operaciones similares al broadcast, pero puede echar mano de funciones para arreglos de *Numpy*.

La documentación del método ```pd.DataFrame.apply()``` puede ser consultada en:

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html

In [1]:
import pandas as pd
import numpy as np

* Se creará un dataframe que consiste en un censo de animales depredadores en diversas regiones geográficas.

In [2]:
indice = ('lobo', 'jaguar', 'coyote', 'halcón', 'lechuza', 'aguila')
poblacion = pd.DataFrame({'Norte-1':(25,
                                     45,
                                     23,
                                     67,
                                     14,
                                     12),
                          'Norte-2':(31,
                                     0,
                                     23,
                                     3,
                                     34,
                                     2),
                          'Sureste-1':(0,
                                       4,
                                       3,
                                       1,
                                       1,
                                       2),
                          'Sureste-2':(2,
                                       0,
                                       12,
                                       23,
                                       11,
                                       2)}, index=indice)

In [3]:
poblacion

         Norte-1  Norte-2  Sureste-1  Sureste-2
lobo          25       31          0          2
jaguar        45        0          4          0
coyote        23       23          3         12
halcón        67        3          1         23
lechuza       14       34          1         11
aguila        12        2          2          2

* La siguiente celda aplicará una función que sumará dos unidades a cada elemento del dataframe.

In [4]:
poblacion.apply(lambda x: x + 2)

         Norte-1  Norte-2  Sureste-1  Sureste-2
lobo          27       33          2          4
jaguar        47        2          6          2
coyote        25       25          5         14
halcón        69        5          3         25
lechuza       16       36          3         13
aguila        14        4          4          4

* La siguiente celda aplicará una función que sumará dos unidades a cada elemento de ```poblacion['Norte-2']```.

In [5]:
poblacion['Norte-2'].apply(lambda x: x + 2)

lobo       33
jaguar      2
coyote     25
halcón      5
lechuza    36
aguila      4
Name: Norte-2, dtype: int64

* La siguiente celda utilizará las propiedades de broadcasting para aplicar una función que suma diversos elementos a cada elemento del dataframe.

In [7]:
poblacion

         Norte-1  Norte-2  Sureste-1  Sureste-2
lobo          25       31          0          2
jaguar        45        0          4          0
coyote        23       23          3         12
halcón        67        3          1         23
lechuza       14       34          1         11
aguila        12        2          2          2

In [6]:
poblacion.apply(lambda x: x + [1, 2, 3, 4, 5, 6])

         Norte-1  Norte-2  Sureste-1  Sureste-2
lobo          26       32          1          3
jaguar        47        2          6          2
coyote        26       26          6         15
halcón        71        7          5         27
lechuza       19       39          6         16
aguila        18        8          8          8

In [9]:
poblacion.apply(lambda x: x + [1, 2, 3, 4], axis=1)

         Norte-1  Norte-2  Sureste-1  Sureste-2
lobo          26       33          3          6
jaguar        46        2          7          4
coyote        24       25          6         16
halcón        68        5          4         27
lechuza       15       36          4         15
aguila        13        4          5          6

In [13]:
def multiplica(x):
    return x * 5

In [14]:
poblacion.apply(multiplica)

         Norte-1  Norte-2  Sureste-1  Sureste-2
lobo         125      155          0         10
jaguar       225        0         20          0
coyote       115      115         15         60
halcón       335       15          5        115
lechuza       70      170          5         55
aguila        60       10         10         10

## Aplicando funciones de *Numpy*.

* La siguiente celda realizará una sumatoria de cada elemento en el eje 0 (columnas) y regresará una serie con los resultados.

In [15]:
poblacion.apply(np.sum)

Norte-1      186
Norte-2       93
Sureste-1     11
Sureste-2     50
dtype: int64

In [16]:
poblacion.apply(np.sum, axis=1)

lobo       58
jaguar     49
coyote     61
halcón     94
lechuza    60
aguila     18
dtype: int64

In [17]:
poblacion.apply(np.mean)

Norte-1      31.000000
Norte-2      15.500000
Sureste-1     1.833333
Sureste-2     8.333333
dtype: float64

In [18]:
poblacion.apply(np.mean, axis=1)

lobo       14.50
jaguar     12.25
coyote     15.25
halcón     23.50
lechuza    15.00
aguila      4.50
dtype: float64

## El método ```pd.DataFrame.transform()```


La documentación del método ```pd.DataFrame.transform()``` puede ser consultada en:

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.transform.html

In [19]:
poblacion

         Norte-1  Norte-2  Sureste-1  Sureste-2
lobo          25       31          0          2
jaguar        45        0          4          0
coyote        23       23          3         12
halcón        67        3          1         23
lechuza       14       34          1         11
aguila        12        2          2          2

In [20]:
poblacion.transform(lambda x: x + [1, 2, 3, 4, 5, 6])

         Norte-1  Norte-2  Sureste-1  Sureste-2
lobo          26       32          1          3
jaguar        47        2          6          2
coyote        26       26          6         15
halcón        71        7          5         27
lechuza       19       39          6         16
aguila        18        8          8          8

In [22]:
poblacion.transform([lambda x: x + [1, 2, 3, 4, 5, 6], np.log])

           Norte-1              Norte-2            Sureste-1            \
        <lambda_0>       log <lambda_0>       log <lambda_0>       log
lobo            26  3.218876         32  3.433987          1      -inf
jaguar          47  3.806662          2      -inf          6  1.386294
coyote          26  3.135494         26  3.135494          6  1.098612
halcón          71  4.204693          7  1.098612          5  0.000000
lechuza         19  2.639057         39  3.526361          6  0.000000
aguila          18  2.484907          8  0.693147          8  0.693147

         Sureste-2
        <lambda_0>       log
lobo             3  0.693147
jaguar           2      -inf
coyote          15  2.484907
halcón          27  3.135494
lechuza         16  2.397895
aguila           8  0.693147

In [23]:
poblacion.transform(np.mean)

ValueError: transforms cannot produce aggregated results

In [24]:
poblacion.transform(lambda x: x - x.min(), axis=1)

         Norte-1  Norte-2  Sureste-1  Sureste-2
lobo          25       31          0          2
jaguar        45        0          4          0
coyote        20       20          0          9
halcón        66        2          0         22
lechuza       13       33          0         10
aguila        10        0          0          0

<p style="text-align: center"><a rel="license" href="http://creativecommons.org/licenses/by/4.0/"><img alt="Licencia Creative Commons" style="border-width:0" src="https://i.creativecommons.org/l/by/4.0/80x15.png" /></a><br />Esta obra está bajo una <a rel="license" href="http://creativecommons.org/licenses/by/4.0/">Licencia Creative Commons Atribución 4.0 Internacional</a>.</p>
<p style="text-align: center">&copy; José Luis Chiquete Valdivieso. 2020.</p>